// Задача 1.
// Написать программу, которая через prompt считывает 
// число и выводит в консоль число равное 10% от введенного числа

// const number = +prompt ("Введите ваше число")
// console.log(`10% от вашего числа это ${number * 10 / 100}`)






//  Задача 2.
// Написать программу, которая получает два числа и выводит наименьшее

// const number1 = +prompt ("Введите первое число")
// const number2 = +prompt ("Введите второе число")

// if(number1 < number2){
//     console.log(number1)
// }else {
//     console.log(number2)
// } 

// Задача 3.
// Написать программу, которая считывает через prompt число 
// и выводит одно из следующих сообщений: ‘Число меньше 100’, 
// ‘Число больше 100’ или ‘Число равно 100’

    // const number = +prompt("Введите число")

    // if (number < 100) {
    //     console.log("Число меньше 100")
    // } else if (number > 100) {
    //     console.log("Число больше 100")
    // } else {
    //     console.log("Числа равны")
    //}

    // Задача 3.
    // Написать программу, которая запрашивает у пользователя его имя
    //  и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, 
    // если пользователь совершеннолетний, или ‘Hi, <name>’, 
    // если пользователь несовершеннолетний.

    // const name = prompt("Введите ваше имя")
    // const age = +prompt("Введите ваш возраст")

    // if (age < 18) {
    //     console.log(`Hi, ${name}.`)
    // } else{
    //     console.log(`Hello, ${name}.`)
    // }


